# Вариант 12
# Дано двузначное число. Найти сумму и произведение чисел его цифр.

while True:
    a = input("Введите двузначное число: ")
    while type(a) != int:
        try:
            a = int(a)
        except ValueError:
            a = input("Ошибка! Введите ДВУЗНАЧНОЕ число: ")

    if 10 <= int(a) <= 99:

        b = a // 10
        c = a % 10


        print("Сумма цифр:", b + c)
        print("Произведение цифр:", b * c)

    else:
        print("Ошибка! Число должно быть двузначным.")

