# Вариант 12
# Дано двузначное число. Найти сумму и произведение чисел его цифр.

while True:
    try:
        a = input("Введите двузначное число: ")
        num = int(a)

        if 10 <= int(a) <= 99:

            b = num // 10
            c = num % 10

            print("Сумма цифр:", b + c)
            print("Произведение цифр:", b * c)
            
        else:
            print("Ошибка! Число должно быть двузначным.")

    except ValueError:
        print("Ошибка! Введите двузначное число.")
